/*************************************************************************
    > File Name: 115.c
    > Author: ma6174
    > Mail: ma6174@163.com 
    > Created Time: 2019年07月21日 星期日 19时35分27秒
 ************************************************************************/

#include<stdio.h>

int main() {
	
	int x, y;
	scanf("%d%d", &x, &y);
	if(x == y) {
		printf("100\n");
	} else if(x % 10 == y /10 && x / 10 == y % 10) {
		printf("20\n");
	} else if(x % 10 == y / 10 || x % 10 == y % 10
			|| x / 10 == y /10 || x / 10 == y % 10) {
		printf("2\n");
	} else {
		printf("0\n");
	}
	return 0;
}
