/*************************************************************************
    > File Name: 120.c
    > Author: ma6174
    > Mail: ma6174@163.com 
    > Created Time: 2019年07月22日 星期一 11时09分24秒
 ************************************************************************/

#include<stdio.h>

int main() {
	int y, m, d;
	int A[12] = {
		31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30 ,31
	};
	scanf("%d%d%d", &y, &m, &d);
	if((y % 4 == 0 && y % 100 != 0) || y % 400 == 0) {
		A[1] = 29;
	}
	if(m > 12 || m < 1) {
		printf("NO\n");
		return 0;
	} else {
		if(d < 1 || d > A[m - 1]) {
			printf("NO\n");
			return 0;
		}
	}
	printf("YES\n");
	return 0;
}
