/*************************************************************************
    > File Name: 438.c
    > Author: liqiang
    > Mail: 1398690148@qq.com 
    > Created Time: 2019年08月14日 星期三 16时44分28秒
 ************************************************************************/

#include <stdio.h>

int main() {
	int n;
	double sum = 0;
	scanf("%d", &n);
	if (n > 400) {
		sum += (n - 400) * 0.7783;
		n = 400;
	} 
	if (n > 240) {
		sum += (n - 240) * 0.5283;
		n = 240;
	}
	sum += n * 0.4783;
	printf("%.1lf\n", sum);
	return 0;
}
